src/InformationRegisters/КИИ_ЖурналКонтроляПерсональныхДанных/КИИ_ЖурналКонтроляПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_ЖурналКонтроляПерсональныхДанных</name>
  <resources>
    <name>Момент</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Канал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КИИ_МоделиИИ</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Режим</name>
    <type>
      <types>EnumRef.КИИ_РежимыКонтроляПерсональныхДанных</types>
    </type>
  </resources>
  <resources>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Решение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОтказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипыСущностей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗамен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БылиЗамены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияГенератораПодстановок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВосстановления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьМиллисекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусАудита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_РежимыКонтроляПерсональныхДанных/КИИ_РежимыКонтроляПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_РежимыКонтроляПерсональныхДанных</name>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
  <enumValues>
    <name>Логировать</name>
  </enumValues>
  <enumValues>
    <name>Маскировать</name>
  </enumValues>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КИИ_МоделиИИ/КИИ_МоделиИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_МоделиИИ</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПоляТекста</name>
    <comment>Возможно content или text</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумТокенов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПровайдера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвторизации</name>
    <type>
      <types>EnumRef.КИИ_ТипыАвторизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФорматаAPI</name>
    <type>
      <types>EnumRef.КИИ_ТипыФорматовAPI</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЖизниКеша</name>
    <comment>TTL для записей кеша ответов ИИ в секундах. 0 = не использовать кеш для модели. Дефолт 86400 (24ч).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыКеша</name>
    <comment>Версия контракта нормализации ключа кеша для этой модели. Инкремент = все старые записи кеша протухли. Дефолт 1.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодели</name>
    <comment>Чат / Эмбеддинг — разделение chat vs embedding.</comment>
    <type>
      <types>EnumRef.КИИ_ТипыМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>EndpointЭмбеддингов</name>
    <comment>Напр. /v1/embeddings (если ТипМодели=Эмбеддинг).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерностьЭмбеддинга</name>
    <comment>1536/256.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксТокеновВхода</name>
    <comment>Лимит для чанкера.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассEgress</name>
    <comment>РФ/внешний — матчится с политикой документа.</comment>
    <type>
      <types>EnumRef.КИИ_ПолитикиЭмбеддинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживаетИнструменты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляПерсональныхДанных</name>
    <type>
      <types>EnumRef.КИИ_РежимыКонтроляПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутДоверенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпечатокДоверенногоМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/КИИ_КонтрольПерсональныхДанных/Module.bsl
#Область ПрограммныйИнтерфейс

// Канал запросов к моделям: промпт, история, фрагменты знаний, результаты инструментов.
//
// Возвращаемое значение:
//  Строка - имя канала.
//
Функция КаналЗапросыКМоделям() Экспорт

	Возврат "ЗапросыКМоделям";

КонецФункции

// Канал уведомлений в Telegram: текст ошибки и разбор уходят во внешний мессенджер.
//
// Возвращаемое значение:
//  Строка - имя канала.
//
Функция КаналУведомленияТелеграм() Экспорт

	Возврат "УведомленияТелеграм";

КонецФункции

// Канал рендера диаграмм: код диаграммы уходит на сервис Kroki.
//
// Возвращаемое значение:
//  Строка - имя канала.
//
Функция КаналРендерДиаграмм() Экспорт

	Возврат "РендерДиаграмм";

КонецФункции

// Создает контекст контроля на одну операцию: соль подстановок и карту соответствий.
// Карта живет только в памяти вызова: в результат, кеш, лог и параметры фоновых заданий не попадает.
//
// Параметры:
//  Канал - Строка - канал, см. КаналЗапросыКМоделям. Пустая строка - канал запросов к моделям.
//
// Возвращаемое значение:
//  Структура - контекст контроля:
//   * ИдентификаторОперации - Строка - идентификатор операции для журнала.
//   * Канал - Строка - канал.
//   * Режим - ПеречислениеСсылка.КИИ_РежимыКонтроляПерсональныхДанных - режим, заданный явно;
//             пустая ссылка - режим определяется настройками канала и модели.
//   * Соль - Строка - случайная соль подстановок операции.
//   * ПодстановкаПоКлючу - Соответствие - тип и нормализованное значение -> подстановка.
//   * ОригиналПоПодстановке - Соответствие - подстановка -> исходное написание значения.
//   * Оригиналы - Соответствие - исходные написания значений, замененных в операции.
//   * ТипыСущностей - Соответствие - типы найденных значений.
//   * КоличествоЗамен - Число - сколько вхождений заменено.
//   * ПроверятьТело - Булево - проверять перед отправкой, что исходных значений в теле нет.
//
Функция НовыйКонтекст(Знач Канал = "") Экспорт

	Контекст = Новый Структура;
	Контекст.Вставить("ИдентификаторОперации", Строка(Новый УникальныйИдентификатор));
	Контекст.Вставить("Канал", ?(ЗначениеЗаполнено(Канал), Канал, КаналЗапросыКМоделям()));
	Контекст.Вставить("Режим", Перечисления.КИИ_РежимыКонтроляПерсональныхДанных.ПустаяСсылка());
	Контекст.Вставить("Соль", Строка(Новый УникальныйИдентификатор));
	Контекст.Вставить("ПодстановкаПоКлючу", Новый Соответствие);
	Контекст.Вставить("ОригиналПоПодстановке", Новый Соответствие);
	Контекст.Вставить("Оригиналы", Новый Соответствие);
	Контекст.Вставить("ТипыСущностей", Новый Соответствие);
	Контекст.Вставить("КоличествоЗамен", 0);
	Контекст.Вставить("ПроверятьТело", Ложь);

	Возврат Контекст;

КонецФункции

// Готовит структуру промпта к отправке во внешнюю модель: находит персональные данные во всех
// текстовых полях и по режиму канала заменяет их подстановками, пропускает с записью в журнал
// или останавливает запрос. Исходная структура не меняется: заменяется независимая копия.
//
// Параметры:
//  СтруктураПромпта - Структура - результат КИИ_КоннекторИИ.ПодготовитьПромпт.
//  Модель - СправочникСсылка.КИИ_МоделиИИ, Неопределено - получатель запроса.
//  Контекст - Структура - см. НовыйКонтекст.
//
// Возвращаемое значение:
//  Структура - результат подготовки:
//   * Разрешено - Булево - запрос можно отправлять.
//   * СтруктураПромпта - Структура - что отправлять: копия с подстановками либо исходная структура.
//   * БылиЗамены - Булево - в отправляемой структуре есть подстановки.
//   * Решение - Строка - Выключено, Пропущено, Записано, Замаскировано, Заблокировано, Ошибка.
//   * КодОтказа - Строка - типизированная причина отказа или сбоя проверки; пустая строка, если проверка прошла.
//   * ТекстОтказа - Строка - описание причины для пользователя, без значений персональных данных.
//
Функция ПодготовитьЗапрос(Знач СтруктураПромпта, Знач Модель, Контекст) Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = НовыйРезультатПодготовки(СтруктураПромпта);
	Режим = РежимДляЗапроса(Контекст, Модель);
	Режимы = Перечисления.КИИ_РежимыКонтроляПерсональныхДанных;

	Если Режим = Режимы.Выключен Тогда
		Результат.Решение = "Выключено";
		Возврат Результат;
	КонецЕсли;

	Попытка
		Копия = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПромпта);
		Обработка = ЗамаскироватьПоляПромпта(Копия, Контекст);
	Исключение
		// Отказ детектора в защищенном режиме останавливает запрос: иначе обход появится в первой аварии.
		Возврат ОтказИлиПропуск(Результат, Режим, "ДетекторНедоступен",
			НСтр("ru = 'Проверка персональных данных не выполнилась, запрос не отправлен.'"),
			Контекст, Модель, Начало);
	КонецПопытки;

	ЗаполнитьРешение(Результат, Режим, Копия, Обработка, Контекст);

	Если Результат.Решение <> "Пропущено" Тогда
		Попытка
			ЗаписатьСобытие(Результат, Режим, Контекст, Модель, Обработка, Начало);
		Исключение
			Возврат ОтказИлиПропуск(Результат, Режим, "ЖурналНедоступен",
				НСтр("ru = 'Журнал контроля персональных данных недоступен, запрос не отправлен.'"),
				Неопределено, Модель, Начало);
		КонецПопытки;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Готовит текст для отправки во внешний канал: уведомление Telegram или код диаграммы для Kroki.
//
// Параметры:
//  Канал - Строка - см. КаналУведомленияТелеграм, КаналРендерДиаграмм.
//  Текст - Строка - текст, который уйдет наружу.
//  Модель - СправочникСсылка.КИИ_МоделиИИ, Неопределено - получатель, если это модель: учитываются ее режим
//           и доверенный маршрут.
//
// Возвращаемое значение:
//  Структура - результат подготовки:
//   * Разрешено - Булево - текст можно отправлять.
//   * Текст - Строка - что отправлять.
//   * Решение - Строка - как для ПодготовитьЗапрос.
//   * КодОтказа - Строка - типизированная причина отказа.
//   * ТекстОтказа - Строка - описание причины без значений персональных данных.
//   * Контекст - Структура - контекст операции для восстановления ответа, см. НовыйКонтекст.
//
Функция ПодготовитьТекстКанала(Знач Канал, Знач Текст, Знач Модель = Неопределено) Экспорт

	Контекст = НовыйКонтекст(Канал);
	Подготовка = ПодготовитьЗапрос(Новый Структура("ПользовательскийПромпт", Текст), Модель, Контекст);

	Результат = Новый Структура;
	Результат.Вставить("Разрешено", Подготовка.Разрешено);
	Результат.Вставить("Текст", Подготовка.СтруктураПромпта.ПользовательскийПромпт);
	Результат.Вставить("Решение", Подготовка.Решение);
	Результат.Вставить("КодОтказа", Подготовка.КодОтказа);
	Результат.Вставить("ТекстОтказа", Подготовка.ТекстОтказа);
	Результат.Вставить("Контекст", Контекст);

	Возврат Результат;

КонецФункции

// Готовит поля запроса к Telegram Bot API: текст сообщения, подпись и имя файла проверяются
// по режиму канала уведомлений. Содержимое файла текстовая проверка не видит, поэтому в режиме
// «Блокировать» файл не отправляется.
//
// Параметры:
//  Поля - Структура - поля запроса (chat_id, text, caption и прочие); не меняется.
//  ИмяФайла - Строка, Неопределено - имя отправляемого файла; Неопределено - файла нет.
//
// Возвращаемое значение:
//  Структура - результат подготовки:
//   * Разрешено - Булево - запрос можно отправлять.
//   * Поля - Структура - что отправлять: новая структура, текстовые поля с подстановками.
//   * ИмяФайла - Строка, Неопределено - имя файла к отправке.
//   * Решение - Строка - как для ПодготовитьЗапрос.
//   * КодОтказа - Строка - типизированная причина отказа.
//   * ТекстОтказа - Строка - описание причины без значений персональных данных.
//
Функция ПодготовитьПоляТелеграм(Знач Поля, Знач ИмяФайла = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Разрешено", Истина);
	Результат.Вставить("Поля", Новый Структура);
	Результат.Вставить("ИмяФайла", ИмяФайла);
	Результат.Вставить("Решение", "Пропущено");
	Результат.Вставить("КодОтказа", "");
	Результат.Вставить("ТекстОтказа", "");

	Для Каждого Поле Из Поля Цикл
		Результат.Поля.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;

	ТекстовыеПоля = Новый Массив;
	Контент = Новый Массив;
	Для Каждого ИмяПоля Из СтрРазделить("text,caption", ",") Цикл
		Если Результат.Поля.Свойство(ИмяПоля) И ТипЗнч(Результат.Поля[ИмяПоля]) = Тип("Строка") Тогда
			ТекстовыеПоля.Добавить(ИмяПоля);
			Контент.Добавить(Новый Структура("Тип, Текст", "text", Результат.Поля[ИмяПоля]));
		КонецЕсли;
	КонецЦикла;
	Если ИмяФайла <> Неопределено Тогда
		Контент.Добавить(Новый Структура("Тип, ИмяФайла", "document", Строка(ИмяФайла)));
	КонецЕсли;

	Если Контент.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Подготовка = ПодготовитьЗапрос(Новый Структура("ПользовательскийПромпт", Контент), Неопределено,
		НовыйКонтекст(КаналУведомленияТелеграм()));
	ЗаполнитьЗначенияСвойств(Результат, Подготовка, "Разрешено, Решение, КодОтказа, ТекстОтказа");

	Если Не Подготовка.БылиЗамены Тогда
		Возврат Результат;
	КонецЕсли;

	Подготовленный = Подготовка.СтруктураПромпта.ПользовательскийПромпт;
	Для Индекс = 0 По ТекстовыеПоля.Количество() - 1 Цикл
		Результат.Поля.Вставить(ТекстовыеПоля[Индекс], Подготовленный[Индекс].Текст);
	КонецЦикла;
	Если ИмяФайла <> Неопределено Тогда
		Результат.ИмяФайла = Подготовленный[Подготовленный.Количество() - 1].ИмяФайла;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Восстанавливает исходные значения в тексте ответа модели для показа человеку. Вызывается только
// для интерактивного представления: машинный результат, кеш, лог и мониторинг остаются с подстановками.
// Восстановление идет одним проходом слева направо, уже вставленные оригиналы повторно не обрабатываются.
//
// Параметры:
//  Текст - Строка - текст ответа модели.
//  Контекст - Структура, Неопределено - контекст операции, см. НовыйКонтекст.
//
// Возвращаемое значение:
//  Структура - результат восстановления:
//   * Текст - Строка - текст с исходными значениями.
//   * Статус - Строка - БезПодстановок, ВосстановленоПолностью, ЧастичноНеУзнано, КартаНедоступна.
//
Функция ВосстановитьДляЧеловека(Знач Текст, Знач Контекст) Экспорт

	Результат = Новый Структура("Текст, Статус", Текст, "БезПодстановок");

	Если Контекст = Неопределено Тогда
		Результат.Статус = "КартаНедоступна";
		Возврат Результат;
	КонецЕсли;

	Если Контекст.ОригиналПоПодстановке.Количество() = 0 Или Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Результат;
	КонецЕсли;

	Вхождения = ВхожденияПодстановок(Текст, Контекст);
	Результат.Текст = ТекстСОригиналами(Текст, Вхождения, Контекст);
	Результат.Статус = ?(ЕстьИскаженныеПодстановки(Текст, Контекст), "ЧастичноНеУзнано", "ВосстановленоПолностью");

	Возврат Результат;

КонецФункции

// Контрольная проверка перед отправкой: в сериализованном теле запроса не должно остаться ни одного
// исходного значения, замененного в операции. Сработка означает, что какой-то путь обошел подготовку.
//
// Параметры:
//  ТелоJSON - Строка - сериализованное тело HTTP-запроса.
//  Контекст - Структура - см. НовыйКонтекст.
//
// Возвращаемое значение:
//  Булево - Истина, если в теле найдено исходное значение.
//
Функция ТелоСодержитОригиналы(Знач ТелоJSON, Знач Контекст) Экспорт

	Если Контекст = Неопределено Или Не Контекст.ПроверятьТело Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого Элемент Из Контекст.Оригиналы Цикл
		Оригинал = Элемент.Ключ;
		Если СтрНайти(ТелоJSON, Оригинал) > 0 Или СтрНайти(ТелоJSON, ЭкранированныйВJSON(Оригинал)) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Текст отказа при утечке исходного значения в тело запроса.
//
// Возвращаемое значение:
//  Строка - описание причины без значений персональных данных.
//
Функция ТекстОтказаУтечки() Экспорт

	Возврат НСтр("ru = 'Контроль персональных данных: исходное значение попало в тело запроса
		|в обход подготовки. Запрос не отправлен.'");

КонецФункции

// Проверка текста для формы настроек: ничего никуда не отправляет и не пишет в журнал.
//
// Параметры:
//  Текст - Строка - проверяемый текст.
//
// Возвращаемое значение:
//  Структура - результат проверки:
//   * Находки - Массив из Структура - найденные значения: Тип, Значение, Начало, Длина, Уверенность, Подстановка.
//   * ТекстПослеЗамены - Строка - как текст уйдет в режиме «Маскировать».
//
Функция ПроверитьТекст(Знач Текст) Экспорт

	Контекст = НовыйКонтекст();
	Находки = КИИ_ПравилаПерсональныхДанных.РазрешитьПересечения(
		КИИ_ПравилаПерсональныхДанных.НайтиСущности(Текст, ВключенныеТипы()));

	Описания = Новый Массив;
	Для Каждого Находка Из Находки Цикл
		Описание = Новый Структура("Тип, Значение, Начало, Длина, Уверенность");
		ЗаполнитьЗначенияСвойств(Описание, Находка);
		Описание.Вставить("Подстановка", ПодстановкаДляНаходки(Находка, Контекст));
		Описания.Добавить(Описание);
	КонецЦикла;

	Возврат Новый Структура("Находки, ТекстПослеЗамены", Описания, ТекстСПодстановками(Текст, Находки, Контекст));

КонецФункции

// Отпечаток маршрута модели: адрес, прокси и идентификатор модели. Смена любого из них аннулирует доверие.
//
// Параметры:
//  Параметры - Структура - см. КИИ_КоннекторИИ.ПараметрыМодели.
//
// Возвращаемое значение:
//  Строка - отпечаток SHA-256 в шестнадцатеричном виде.
//
Функция ОтпечатокМаршрута(Знач Параметры) Экспорт

	Части = Новый Массив;
	Части.Добавить(НРег(СокрЛП(Параметры.Адрес)));
	Части.Добавить(Строка(Параметры.ИспользоватьПрокси));
	Части.Добавить(СокрЛП(Параметры.НаименованиеПолное));
	Если Параметры.ИспользоватьПрокси Тогда
		УстановитьПривилегированныйРежим(Истина);
		Части.Добавить(СокрЛП(Константы.КИИ_АдресПроксиИнтернет.Получить()));
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Возврат ХешСтроки(СтрСоединить(Части, "|"));

КонецФункции

// Регламентная очистка журнала контроля по сроку хранения.
//
Процедура ОчиститьЖурналКонтроля() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.КИИ_ОчисткаЖурналаКонтроляПерсональныхДанных);

	УстановитьПривилегированныйРежим(Истина);
	СрокДней = Константы.КИИ_СрокХраненияСобытийКонтроля.Получить();
	Если СрокДней <= 0 Тогда
		СрокДней = 30;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Журнал.ИдентификаторСобытия КАК ИдентификаторСобытия
		|ИЗ
		|	РегистрСведений.КИИ_ЖурналКонтроляПерсональныхДанных КАК Журнал
		|ГДЕ
		|	Журнал.Момент < &Граница";
	Запрос.УстановитьПараметр("Граница", ТекущаяДатаСеанса() - СрокДней * 86400);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КИИ_ЖурналКонтроляПерсональныхДанных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСобытия.Установить(Выборка.ИдентификаторСобытия);
		НаборЗаписей.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Режимы

Функция РежимДляЗапроса(Знач Контекст, Знач Модель)

	Если ЗначениеЗаполнено(Контекст.Режим) Тогда
		Возврат Контекст.Режим;
	КонецЕсли;

	Режим = РежимКанала(Контекст.Канал);

	Если Не ЗначениеЗаполнено(Модель) Тогда
		Возврат Режим;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Модель,
		"РежимКонтроляПерсональныхДанных, МаршрутДоверенный, ОтпечатокДоверенногоМаршрута");
	УстановитьПривилегированныйРежим(Ложь);

	Если ЗначениеЗаполнено(Реквизиты.РежимКонтроляПерсональныхДанных) Тогда
		Режим = Реквизиты.РежимКонтроляПерсональныхДанных;
	КонецЕсли;

	Если МаршрутДоверен(Модель, Реквизиты) Тогда
		Возврат Перечисления.КИИ_РежимыКонтроляПерсональныхДанных.Выключен;
	КонецЕсли;

	Возврат Режим;

КонецФункции

// Пустая или неизвестная настройка защиту не отключает: берется режим канала по умолчанию.
Функция РежимКанала(Знач Канал)

	Режимы = Перечисления.КИИ_РежимыКонтроляПерсональныхДанных;

	УстановитьПривилегированныйРежим(Истина);
	Если Канал = КаналУведомленияТелеграм() Тогда
		Режим = Константы.КИИ_РежимКонтроляУведомленийТелеграм.Получить();
		ПоУмолчанию = Режимы.Маскировать;
	ИначеЕсли Канал = КаналРендерДиаграмм() Тогда
		Режим = ?(Константы.КИИ_РендерДиаграммДоверенный.Получить(), Режимы.Выключен,
			Константы.КИИ_РежимКонтроляРендераДиаграмм.Получить());
		ПоУмолчанию = Режимы.Логировать;
	Иначе
		Режим = Константы.КИИ_РежимКонтроляЗапросовКМоделям.Получить();
		ПоУмолчанию = Режимы.Маскировать;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ?(ЗначениеЗаполнено(Режим), Режим, ПоУмолчанию);

КонецФункции

Функция МаршрутДоверен(Знач Модель, Знач Реквизиты)

	Если Не Реквизиты.МаршрутДоверенный Или Не ЗначениеЗаполнено(Реквизиты.ОтпечатокДоверенногоМаршрута) Тогда
		Возврат Ложь;
	КонецЕсли;

	// Доверие привязано к отпечатку: сменили адрес, прокси или модель - доверие аннулировано.
	Возврат Реквизиты.ОтпечатокДоверенногоМаршрута = ОтпечатокМаршрута(КИИ_КоннекторИИ.ПараметрыМодели(Модель));

КонецФункции

Функция ВключенныеТипы()

	УстановитьПривилегированныйРежим(Истина);
	Настройка = Константы.КИИ_ВключенныеПравилаПерсональныхДанных.Получить();
	УстановитьПривилегированныйРежим(Ложь);

	Известные = СтрРазделить("СНИЛС,КАРТА,ИНН,ПАСПОРТ,EMAIL,ТЕЛЕФОН,ФИО", ",");
	Типы = Новый Массив;
	Для Каждого Элемент Из СтрРазделить(ВРег(Настройка), ",", Ложь) Цикл
		Если Известные.Найти(СокрЛП(Элемент)) <> Неопределено Тогда
			Типы.Добавить(СокрЛП(Элемент));
		КонецЕсли;
	КонецЦикла;

	// Пустая или испорченная настройка не отключает правила: включены все.
	Возврат ?(Типы.Количество() = 0, Неопределено, Типы);

КонецФункции

#КонецОбласти

#Область Подготовка

Функция НовыйРезультатПодготовки(Знач СтруктураПромпта)

	Результат = Новый Структура;
	Результат.Вставить("Разрешено", Истина);
	Результат.Вставить("СтруктураПромпта", СтруктураПромпта);
	Результат.Вставить("БылиЗамены", Ложь);
	Результат.Вставить("Решение", "Пропущено");
	Результат.Вставить("КодОтказа", "");
	Результат.Вставить("ТекстОтказа", "");

	Возврат Результат;

КонецФункции

Процедура ЗаполнитьРешение(Результат, Знач Режим, Знач Копия, Знач Обработка, Контекст)

	Режимы = Перечисления.КИИ_РежимыКонтроляПерсональныхДанных;
	НайденыДанные = Обработка.Замен > 0;

	Если Режим = Режимы.Логировать Тогда
		Результат.Решение = ?(НайденыДанные, "Записано", "Пропущено");
		Возврат;
	КонецЕсли;

	Если Обработка.НеПоддержано.Количество() > 0 Тогда
		Отказать(Результат, "НеподдержанноеПоле",
			НСтр("ru = 'В запросе есть поле, которое контроль персональных данных не умеет проверять. Запрос не отправлен.'"));
		Возврат;
	КонецЕсли;

	Если Режим = Режимы.Блокировать И НайденыДанные Тогда
		Шаблон = НСтр("ru = 'В запросе найдены персональные данные (%1), режим канала запрещает отправку.'");
		Типы = ТипыСтрокой(Контекст);
		Отказать(Результат, "НайденыПерсональныеДанные", СтрШаблон(Шаблон, Типы));
		Возврат;
	КонецЕсли;

	Если Режим = Режимы.Блокировать И Обработка.ЕстьВложения Тогда
		Отказать(Результат, "ВложенияПриБлокировке",
			НСтр("ru = 'В запросе есть вложения: их содержимое проверить нельзя, режим канала запрещает отправку.'"));
		Возврат;
	КонецЕсли;

	Если Не НайденыДанные Тогда
		Возврат;
	КонецЕсли;

	Если Контекст.Канал = КаналЗапросыКМоделям() Тогда
		ДобавитьИнструкциюМодели(Копия);
	КонецЕсли;
	Результат.СтруктураПромпта = Копия;
	Результат.БылиЗамены = Истина;
	Результат.Решение = "Замаскировано";
	Контекст.ПроверятьТело = Истина;

КонецПроцедуры

Процедура Отказать(Результат, Знач КодОтказа, Знач ТекстОтказа)

	Результат.Разрешено = Ложь;
	Результат.Решение = "Заблокировано";
	Результат.КодОтказа = КодОтказа;
	Результат.ТекстОтказа = ТекстОтказа;

КонецПроцедуры

// В режиме «Логировать» сбой не останавливает запрос, в защищенных режимах - останавливает.
Функция ОтказИлиПропуск(Результат, Знач Режим, Знач КодОтказа, Знач ТекстОтказа, Знач Контекст,
	Знач Модель, Знач Начало)

	// В «Логировать» запрос уходит, но сбой проверки все равно попадает в журнал с кодом причины.
	Если Режим <> Перечисления.КИИ_РежимыКонтроляПерсональныхДанных.Логировать Тогда
		Отказать(Результат, КодОтказа, ТекстОтказа);
	КонецЕсли;
	Результат.Решение = "Ошибка";
	Результат.КодОтказа = КодОтказа;

	// Журнал контроля недоступен (контекст не передан) или сам упал - след остается в журнале регистрации.
	// Текст исключения туда не пишется: в нем могут оказаться значения из проверяемого текста.
	ЗаписаноВЖурнал = Ложь;
	Если Контекст <> Неопределено Тогда
		Попытка
			ЗаписатьСобытие(Результат, Режим, Контекст, Модель, Неопределено, Начало);
			ЗаписаноВЖурнал = Истина;
		Исключение
			ЗаписаноВЖурнал = Ложь;
		КонецПопытки;
	КонецЕсли;
	Если Не ЗаписаноВЖурнал Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.КонтрольПерсональныхДанных'"),
			УровеньЖурналаРегистрации.Предупреждение, , , КодОтказа);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ДобавитьИнструкциюМодели(СтруктураПромпта)

	Инструкция = НСтр("ru = 'Часть значений в запросе заменена условными подстановками. Используй их дословно,
		|как написано: не склоняй, не исправляй и не заменяй другими значениями.'");

	// В агентском сценарии системный промпт не доходит до модели: сообщения идут массивом дословно.
	СырыеСообщения = Неопределено;
	СтруктураПромпта.Свойство("СырыеСообщения", СырыеСообщения);
	Если ТипЗнч(СырыеСообщения) = Тип("Массив") И СырыеСообщения.Количество() > 0 Тогда
		СтруктураПромпта.СырыеСообщения.Вставить(0, Новый Структура("role, content", "system", Инструкция));
		Возврат;
	КонецЕсли;

	Если СтруктураПромпта.Свойство("СистемныйПромпт") И ЗначениеЗаполнено(СтруктураПромпта.СистемныйПромпт) Тогда
		СтруктураПромпта.СистемныйПромпт = СтруктураПромпта.СистемныйПромпт + Символы.ПС + Инструкция;
	Иначе
		СтруктураПромпта.Вставить("СистемныйПромпт", Инструкция);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбходПолей

// Закрытый перечень полей: что не распознано - НеПоддержано, а не «пропустим».
Функция ЗамаскироватьПоляПромпта(СтруктураПромпта, Контекст)

	Обработка = Новый Структура("Замен, НеПоддержано, ЕстьВложения", 0, Новый Массив, Ложь);
	ЗаменДо = Контекст.КоличествоЗамен;
	Типы = ВключенныеТипы();

	Если СтруктураПромпта.Свойство("СистемныйПромпт") Тогда
		СтруктураПромпта.СистемныйПромпт = ЗамаскироватьЗначение(СтруктураПромпта.СистемныйПромпт,
			"СистемныйПромпт", Контекст, Типы, Обработка);
	КонецЕсли;

	Если СтруктураПромпта.Свойство("ПользовательскийПромпт") Тогда
		СтруктураПромпта.ПользовательскийПромпт = ЗамаскироватьКонтент(СтруктураПромпта.ПользовательскийПромпт,
			"ПользовательскийПромпт", Контекст, Типы, Обработка);
	КонецЕсли;

	Если СтруктураПромпта.Свойство("ИсторияСообщений") Тогда
		ЗамаскироватьИсторию(СтруктураПромпта.ИсторияСообщений, Контекст, Типы, Обработка);
	КонецЕсли;

	Если СтруктураПромпта.Свойство("СырыеСообщения") Тогда
		ЗамаскироватьСырыеСообщения(СтруктураПромпта.СырыеСообщения, Контекст, Типы, Обработка);
	КонецЕсли;

	// Инструменты не проверяются: их объявления пишет разработчик расширения, данных пользователя там нет.
	Обработка.Замен = Контекст.КоличествоЗамен - ЗаменДо;

	Возврат Обработка;

КонецФункции

Функция ЗамаскироватьЗначение(Знач Значение, Знач ИмяПоля, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат ЗамаскироватьТекст(Значение, Контекст, Типы);
	КонецЕсли;

	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат Значение;
	КонецЕсли;

	Обработка.НеПоддержано.Добавить(ИмяПоля);
	Возврат Значение;

КонецФункции

// В имени файла слова часто разделены подчеркиванием: «Выписка_ИНН_7707083893.xlsx». Для поиска
// подчеркивания читаются как пробелы; если замен нет, имя уходит нетронутым.
Функция ЗамаскироватьИмяФайла(Знач ИмяФайла, Знач ИмяПоля, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(ИмяФайла) <> Тип("Строка") Или СтрНайти(ИмяФайла, "_") = 0 Тогда
		Возврат ЗамаскироватьЗначение(ИмяФайла, ИмяПоля, Контекст, Типы, Обработка);
	КонецЕсли;

	СПробелами = СтрЗаменить(ИмяФайла, "_", " ");
	Замаскированное = ЗамаскироватьЗначение(СПробелами, ИмяПоля, Контекст, Типы, Обработка);

	Возврат ?(Замаскированное = СПробелами, ИмяФайла, Замаскированное);

КонецФункции

Функция ЗамаскироватьКонтент(Знач Контент, Знач ИмяПоля, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(Контент) <> Тип("Массив") Тогда
		Возврат ЗамаскироватьЗначение(Контент, ИмяПоля, Контекст, Типы, Обработка);
	КонецЕсли;

	Для Каждого Элемент Из Контент Цикл
		ЗамаскироватьЭлементКонтента(Элемент, ИмяПоля, Контекст, Типы, Обработка);
	КонецЦикла;

	Возврат Контент;

КонецФункции

Процедура ЗамаскироватьЭлементКонтента(Элемент, Знач ИмяПоля, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
		Обработка.НеПоддержано.Добавить(ИмяПоля);
		Возврат;
	КонецЕсли;

	ТипЭлемента = "";
	Элемент.Свойство("Тип", ТипЭлемента);

	Если ТипЭлемента = "text" Тогда
		Элемент.Текст = ЗамаскироватьЗначение(Элемент.Текст, ИмяПоля, Контекст, Типы, Обработка);
		Возврат;
	КонецЕсли;

	Если ТипЭлемента = "image" Или ТипЭлемента = "document" Тогда
		// Содержимое файла текстовая маскировка не трогает; имя файла проверяется как текст.
		Обработка.ЕстьВложения = Истина;
		Если Элемент.Свойство("ИмяФайла") Тогда
			Элемент.ИмяФайла = ЗамаскироватьИмяФайла(Элемент.ИмяФайла, ИмяПоля, Контекст, Типы, Обработка);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Обработка.НеПоддержано.Добавить(ИмяПоля);

КонецПроцедуры

Процедура ЗамаскироватьИсторию(ИсторияСообщений, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(ИсторияСообщений) <> Тип("Массив") Тогда
		Обработка.НеПоддержано.Добавить("ИсторияСообщений");
		Возврат;
	КонецЕсли;

	Для Каждого Сообщение Из ИсторияСообщений Цикл
		Если ТипЗнч(Сообщение) = Тип("Структура") И Сообщение.Свойство("Текст") Тогда
			Сообщение.Текст = ЗамаскироватьКонтент(Сообщение.Текст, "ИсторияСообщений", Контекст, Типы, Обработка);
		Иначе
			Обработка.НеПоддержано.Добавить("ИсторияСообщений");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗамаскироватьСырыеСообщения(СырыеСообщения, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(СырыеСообщения) <> Тип("Массив") Тогда
		Обработка.НеПоддержано.Добавить("СырыеСообщения");
		Возврат;
	КонецЕсли;

	Для Каждого Сообщение Из СырыеСообщения Цикл

		Если ТипЗнч(Сообщение) <> Тип("Структура") Тогда
			Обработка.НеПоддержано.Добавить("СырыеСообщения");
			Продолжить;
		КонецЕсли;

		Если Сообщение.Свойство("content") Тогда
			Сообщение.content = ЗамаскироватьЧастиСообщения(Сообщение.content, Контекст, Типы, Обработка);
		КонецЕсли;

		Если Сообщение.Свойство("tool_calls") И ТипЗнч(Сообщение.tool_calls) = Тип("Массив") Тогда
			ЗамаскироватьВызовыИнструментов(Сообщение.tool_calls, Контекст, Типы, Обработка);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// content сообщения OpenAI: строка либо массив частей {type, text}.
Функция ЗамаскироватьЧастиСообщения(Знач Содержимое, Контекст, Знач Типы, Обработка)

	Если ТипЗнч(Содержимое) <> Тип("Массив") Тогда
		Возврат ЗамаскироватьЗначение(Содержимое, "СырыеСообщения", Контекст, Типы, Обработка);
	КонецЕсли;

	Для Каждого Часть Из Содержимое Цикл
		Если ТипЗнч(Часть) = Тип("Структура") И Часть.Свойство("text") Тогда
			Часть.text = ЗамаскироватьЗначение(Часть.text, "СырыеСообщения", Контекст, Типы, Обработка);
		ИначеЕсли ТипЗнч(Часть) = Тип("Структура") И Часть.Свойство("image_url") Тогда
			Обработка.ЕстьВложения = Истина;
		Иначе
			Обработка.НеПоддержано.Добавить("СырыеСообщения");
		КонецЕсли;
	КонецЦикла;

	Возврат Содержимое;

КонецФункции

// Аргументы вызова - строка JSON от модели: подстановки в ней безопасны, их символы в JSON не экранируются.
Процедура ЗамаскироватьВызовыИнструментов(ВызовыИнструментов, Контекст, Знач Типы, Обработка)

	Для Каждого Вызов Из ВызовыИнструментов Цикл
		Если ЭтоВызовСАргументами(Вызов) Тогда
			Вызов.function.arguments = ЗамаскироватьЗначение(Вызов.function.arguments, "СырыеСообщения",
				Контекст, Типы, Обработка);
		Иначе
			Обработка.НеПоддержано.Добавить("СырыеСообщения");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ЭтоВызовСАргументами(Знач Вызов)

	Если ТипЗнч(Вызов) <> Тип("Структура") Или Не Вызов.Свойство("function") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ТипЗнч(Вызов.function) = Тип("Структура") И Вызов.function.Свойство("arguments");

КонецФункции

Функция ЗамаскироватьТекст(Знач Текст, Контекст, Знач Типы)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Текст;
	КонецЕсли;

	Находки = КИИ_ПравилаПерсональныхДанных.РазрешитьПересечения(
		КИИ_ПравилаПерсональныхДанных.НайтиСущности(Текст, Типы));

	Если Находки.Количество() = 0 Тогда
		Возврат Текст;
	КонецЕсли;

	Возврат ТекстСПодстановками(Текст, Находки, Контекст);

КонецФункции

Функция ТекстСПодстановками(Знач Текст, Знач Находки, Контекст)

	Части = Новый Массив;
	Позиция = 1;
	Для Каждого Находка Из Находки Цикл
		Части.Добавить(Сред(Текст, Позиция, Находка.Начало - Позиция));
		Части.Добавить(ПодстановкаДляНаходки(Находка, Контекст));
		Позиция = Находка.Начало + Находка.Длина;
	КонецЦикла;
	Части.Добавить(Сред(Текст, Позиция));

	Возврат СтрСоединить(Части, "");

КонецФункции

#КонецОбласти

#Область Подстановки

// Подстановка детерминирована внутри операции: одно значение - одна подстановка. Карта взаимно
// однозначна: кандидат, уже занятый другим значением или совпавший с исходным, отбрасывается.
Функция ПодстановкаДляНаходки(Знач Находка, Контекст)

	// Значение уже является подстановкой этой операции (агентская петля несет прошлые ответы модели):
	// повторно не заменяется, иначе цепочка восстановления порвется.
	Если Контекст.ОригиналПоПодстановке[Находка.Значение] <> Неопределено Тогда
		Возврат Находка.Значение;
	КонецЕсли;

	Ключ = Находка.Тип + "|" + Находка.НормализованныйКлюч;
	Подстановка = Контекст.ПодстановкаПоКлючу[Ключ];

	Если Подстановка = Неопределено Тогда
		Подстановка = НоваяПодстановка(Находка, Ключ, Контекст);
		Контекст.ПодстановкаПоКлючу.Вставить(Ключ, Подстановка);
		Контекст.ОригиналПоПодстановке.Вставить(Подстановка, Находка.Значение);
	КонецЕсли;

	Контекст.Оригиналы.Вставить(Находка.Значение, Истина);
	Контекст.ТипыСущностей.Вставить(Находка.Тип, Истина);
	Контекст.КоличествоЗамен = Контекст.КоличествоЗамен + 1;

	Возврат Подстановка;

КонецФункции

Функция НоваяПодстановка(Знач Находка, Знач Ключ, Знач Контекст)

	Для НомерВарианта = 0 По 99 Цикл
		Хеш = ХешСтроки(Контекст.Соль + "|" + Ключ + "|" + Формат(НомерВарианта, "ЧН=0; ЧГ=0"));
		Кандидат = СгенерироватьПодстановку(Находка, Хеш);
		Занят = Контекст.ОригиналПоПодстановке[Кандидат] <> Неопределено
			Или Контекст.Оригиналы[Кандидат] <> Неопределено
			Или Кандидат = Находка.Значение;
		Если Не Занят Тогда
			Возврат Кандидат;
		КонецЕсли;
	КонецЦикла;

	ВызватьИсключение НСтр("ru = 'Исчерпаны варианты подстановок персональных данных'");

КонецФункции

// Подстановки берутся из заведомо несуществующих диапазонов: телефон с кодом 000, почта
// на зарезервированном домене example.com, ИНН с регионом 00, СНИЛС 000, карта с BIN 0000,
// паспорт серии 00 00. Формат и контрольные суммы валидны, принадлежать человеку значение не может.
Функция СгенерироватьПодстановку(Знач Находка, Знач Хеш)

	Если Находка.Тип = "ФИО" Тогда
		Возврат ПодстановкаФИО(Находка, Хеш);
	КонецЕсли;

	Если Находка.Тип = "EMAIL" Тогда
		Возврат "user." + Лев(Хеш, 8) + "@example.com";
	КонецЕсли;

	Если Находка.Тип = "ТЕЛЕФОН" Тогда
		Цифры = ЦифрыИзХеша(Хеш, 7);
		Возврат "+7 000 " + Лев(Цифры, 3) + "-" + Сред(Цифры, 4, 2) + "-" + Сред(Цифры, 6, 2);
	КонецЕсли;

	Если Находка.Тип = "ИНН" Тогда
		Возврат ПодстановкаИНН(СтрДлина(Находка.НормализованныйКлюч), Хеш);
	КонецЕсли;

	Если Находка.Тип = "СНИЛС" Тогда
		Возврат ПодстановкаСНИЛС(Хеш);
	КонецЕсли;

	Если Находка.Тип = "КАРТА" Тогда
		Возврат ПодстановкаКарты(Хеш);
	КонецЕсли;

	Если Находка.Тип = "ПАСПОРТ" Тогда
		Возврат "00 00 " + ЦифрыИзХеша(Хеш, 6);
	КонецЕсли;

	ВызватьИсключение СтрШаблон(НСтр("ru = 'Нет генератора подстановок для типа %1'"), Находка.Тип);

КонецФункции

Функция ПодстановкаИНН(Знач Длина, Знач Хеш)

	Если Длина = 12 Тогда
		Основа = "00" + ЦифрыИзХеша(Хеш, 8);
		Одиннадцатая = КонтрольнаяЦифраИНН(Основа, "7,2,4,10,3,5,9,4,6,8");
		Двенадцатая = КонтрольнаяЦифраИНН(Основа + Одиннадцатая, "3,7,2,4,10,3,5,9,4,6,8");
		Возврат Основа + Одиннадцатая + Двенадцатая;
	КонецЕсли;

	Основа = "00" + ЦифрыИзХеша(Хеш, 7);
	Возврат Основа + КонтрольнаяЦифраИНН(Основа, "2,4,10,3,5,9,4,6,8");

КонецФункции

Функция КонтрольнаяЦифраИНН(Знач Цифры, Знач СтрокаВесов)

	Веса = СтрРазделить(СтрокаВесов, ",");
	Сумма = 0;
	Для Позиция = 1 По Веса.Количество() Цикл
		Сумма = Сумма + Число(Сред(Цифры, Позиция, 1)) * Число(Веса[Позиция - 1]);
	КонецЦикла;

	Возврат Формат(Сумма % 11 % 10, "ЧН=0; ЧГ=0");

КонецФункции

Функция ПодстановкаСНИЛС(Знач Хеш)

	Основа = "000" + ЦифрыИзХеша(Хеш, 6);
	Сумма = 0;
	Для Позиция = 1 По 9 Цикл
		Сумма = Сумма + Число(Сред(Основа, Позиция, 1)) * (10 - Позиция);
	КонецЦикла;
	Контрольное = Сумма % 101;
	Если Контрольное = 100 Тогда
		Контрольное = 0;
	КонецЕсли;

	Возврат Лев(Основа, 3) + "-" + Сред(Основа, 4, 3) + "-" + Сред(Основа, 7, 3) + " "
		+ Формат(Контрольное, "ЧЦ=2; ЧВН=; ЧН=00; ЧГ=0");

КонецФункции

Функция ПодстановкаКарты(Знач Хеш)

	Основа = "000000" + ЦифрыИзХеша(Хеш, 9);
	Цифры = Основа + КонтрольнаяЦифраЛуна(Основа);

	Возврат Лев(Цифры, 4) + " " + Сред(Цифры, 5, 4) + " " + Сред(Цифры, 9, 4) + " " + Сред(Цифры, 13, 4);

КонецФункции

Функция КонтрольнаяЦифраЛуна(Знач Основа)

	Сумма = 0;
	Длина = СтрДлина(Основа);
	Для Позиция = 1 По Длина Цикл
		Значение = Число(Сред(Основа, Длина - Позиция + 1, 1));
		// Справа налево, начиная с цифры перед будущей контрольной: удваивается каждая нечетная.
		Если Позиция % 2 = 1 Тогда
			Значение = Значение * 2;
			Если Значение > 9 Тогда
				Значение = Значение - 9;
			КонецЕсли;
		КонецЕсли;
		Сумма = Сумма + Значение;
	КонецЦикла;

	Возврат Формат((10 - Сумма % 10) % 10, "ЧН=0; ЧГ=0");

КонецФункции

Функция ПодстановкаФИО(Знач Находка, Знач Хеш)

	Слова = СловаИмени(Находка.Значение);
	Женское = ЭтоЖенскоеИмя(Слова, Находка.Детектор);
	Фамилия = ЭлементСписка(?(Женское, ФамилииЖенские(), ФамилииМужские()), Хеш, 1);

	// Подстановка повторяет форму исходного значения: порядок слов и сокращение инициалами.
	Буквы = СтрРазделить("А,Б,В,Г,Д,Е,К,Л,М,Н,П,Р,С,Т", ",");
	Инициалы = ЭлементСписка(Буквы, Хеш, 9) + "." + ЭлементСписка(Буквы, Хеш, 11) + ".";
	Если Находка.Детектор = "ФамилияСИнициалами" Тогда
		Возврат Фамилия + " " + Инициалы;
	КонецЕсли;
	Если Находка.Детектор = "ИнициалыИФамилия" Тогда
		Возврат Инициалы + " " + Фамилия;
	КонецЕсли;

	Имя = ЭлементСписка(?(Женское, ИменаЖенские(), ИменаМужские()), Хеш, 3);
	Отчество = ЭлементСписка(?(Женское, ОтчестваЖенские(), ОтчестваМужские()), Хеш, 5);
	Если Находка.Детектор = "ИмяОтчествоФамилия" Тогда
		Возврат Имя + " " + Отчество + " " + Фамилия;
	КонецЕсли;

	Возврат Фамилия + " " + Имя + " " + Отчество;

КонецФункции

// Слова имени без учета того, чем они разделены в тексте: пробелом, переносом строки или табуляцией.
Функция СловаИмени(Знач Значение)

	Возврат СтрРазделить(Значение, " " + Символы.ПС + Символы.ВК + Символы.Таб, Ложь);

КонецФункции

// Род определяется по отчеству, если оно есть, иначе по окончанию фамилии.
Функция ЭтоЖенскоеИмя(Знач Слова, Знач Детектор)

	Последнее = Слова.Количество() - 1;
	ИндексОтчества = -1;
	Если Детектор = "ИмяТриСлова" Тогда
		ИндексОтчества = Последнее;
	КонецЕсли;
	Если Детектор = "ИмяОтчествоФамилия" Тогда
		ИндексОтчества = 1;
	КонецЕсли;
	Если ИндексОтчества >= 0 И ИндексОтчества <= Последнее Тогда
		Отчество = НРег(Слова[ИндексОтчества]);
		Возврат СтрЗаканчиваетсяНа(Отчество, "вна") Или СтрЗаканчиваетсяНа(Отчество, "чна");
	КонецЕсли;

	Фамилия = НРег(Слова[?(Детектор = "ИнициалыИФамилия", Последнее, 0)]);
	Возврат СтрЗаканчиваетсяНа(Фамилия, "ова") Или СтрЗаканчиваетсяНа(Фамилия, "ева")
		Или СтрЗаканчиваетсяНа(Фамилия, "ина") Или СтрЗаканчиваетсяНа(Фамилия, "ая");

КонецФункции

Функция ЭлементСписка(Знач Список, Знач Хеш, Знач Смещение)

	Индекс = ЧислоИзХеша(Хеш, Смещение, 2) % Список.Количество();
	Возврат Список[Индекс];

КонецФункции

Функция ФамилииМужские()

	Возврат СтрРазделить("Ковалев,Лебедев,Соколов,Морозов,Волков,Зайцев,Павлов,Семенов,Голубев,Виноградов,"
		+ "Богданов,Воробьев,Федоров,Михайлов,Беляев,Тарасов,Белов,Комаров,Орлов,Киселев", ",");

КонецФункции

Функция ФамилииЖенские()

	Возврат СтрРазделить("Ковалева,Лебедева,Соколова,Морозова,Волкова,Зайцева,Павлова,Семенова,Голубева,Виноградова,"
		+ "Богданова,Воробьева,Федорова,Михайлова,Беляева,Тарасова,Белова,Комарова,Орлова,Киселева", ",");

КонецФункции

Функция ИменаМужские()

	Возврат СтрРазделить("Артем,Максим,Дмитрий,Никита,Егор,Илья,Кирилл,Роман,Глеб,Олег,Павел,Тимур", ",");

КонецФункции

Функция ИменаЖенские()

	Возврат СтрРазделить("Алина,Мария,Дарья,Полина,Ксения,Вера,Ольга,Юлия,Нина,Елена,Софья,Таисия", ",");

КонецФункции

Функция ОтчестваМужские()

	Возврат СтрРазделить("Андреевич,Борисович,Викторович,Геннадьевич,Денисович,Игоревич,Кириллович,"
		+ "Леонидович,Маркович,Олегович,Петрович,Романович", ",");

КонецФункции

Функция ОтчестваЖенские()

	Возврат СтрРазделить("Андреевна,Борисовна,Викторовна,Геннадьевна,Денисовна,Игоревна,Кирилловна,"
		+ "Леонидовна,Марковна,Олеговна,Петровна,Романовна", ",");

КонецФункции

#КонецОбласти

#Область Восстановление

// Все вхождения всех подстановок в тексте, по возрастанию позиции, без пересечений.
Функция ВхожденияПодстановок(Знач Текст, Знач Контекст)

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Начало", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Длина", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Подстановка", Новый ОписаниеТипов("Строка"));

	Для Каждого Элемент Из Контекст.ОригиналПоПодстановке Цикл
		Позиция = СтрНайти(Текст, Элемент.Ключ);
		Пока Позиция > 0 Цикл
			Вхождение = Таблица.Добавить();
			Вхождение.Начало = Позиция;
			Вхождение.Длина = СтрДлина(Элемент.Ключ);
			Вхождение.Подстановка = Элемент.Ключ;
			Позиция = СтрНайти(Текст, Элемент.Ключ, , Позиция + Вхождение.Длина);
		КонецЦикла;
	КонецЦикла;

	Таблица.Сортировать("Начало Возр, Длина Убыв");

	Возврат Таблица;

КонецФункции

Функция ТекстСОригиналами(Знач Текст, Знач Вхождения, Знач Контекст)

	Части = Новый Массив;
	Позиция = 1;
	Для Каждого Вхождение Из Вхождения Цикл
		Если Вхождение.Начало < Позиция Тогда
			Продолжить;
		КонецЕсли;
		Части.Добавить(Сред(Текст, Позиция, Вхождение.Начало - Позиция));
		Части.Добавить(Контекст.ОригиналПоПодстановке[Вхождение.Подстановка]);
		Позиция = Вхождение.Начало + Вхождение.Длина;
	КонецЦикла;
	Части.Добавить(Сред(Текст, Позиция));

	Возврат СтрСоединить(Части, "");

КонецФункции

// Подставная фамилия встречается в тексте не целиком (модель ее просклоняла): такое место
// не восстановится, и человек должен об этом знать.
Функция ЕстьИскаженныеПодстановки(Знач Текст, Знач Контекст)

	// Целые подстановки вырезаются: их восстановление уже сделано. Если в остатке встречается основа
	// подставной фамилии, модель ее просклоняла или разорвала, и это место человек увидит с подстановкой.
	// Имя и отчество не проверяются: их основы совпадают с обычными словами («Вера» - «Версия»).
	Остаток = Текст;
	Для Каждого Элемент Из Контекст.ОригиналПоПодстановке Цикл
		Остаток = СтрЗаменить(Остаток, Элемент.Ключ, " ");
	КонецЦикла;

	Фамилии = Новый Соответствие;
	Для Каждого Фамилия Из ФамилииМужские() Цикл
		Фамилии.Вставить(Фамилия, Истина);
	КонецЦикла;
	Для Каждого Фамилия Из ФамилииЖенские() Цикл
		Фамилии.Вставить(Фамилия, Истина);
	КонецЦикла;

	Для Каждого Элемент Из Контекст.ОригиналПоПодстановке Цикл
		Для Каждого Слово Из СловаИмени(Элемент.Ключ) Цикл
			Если Фамилии[Слово] <> Неопределено И СтрНайти(Остаток, Лев(Слово, СтрДлина(Слово) - 1)) > 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область Журнал

Процедура ЗаписатьСобытие(Знач Результат, Знач Режим, Знач Контекст, Знач Модель, Знач Обработка, Знач Начало)

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.КИИ_ЖурналКонтроляПерсональныхДанных.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСобытия = Строка(Новый УникальныйИдентификатор);
	МенеджерЗаписи.Момент = ТекущаяДатаСеанса();
	МенеджерЗаписи.Канал = Контекст.Канал;
	МенеджерЗаписи.Модель = ?(ЗначениеЗаполнено(Модель), Модель, Справочники.КИИ_МоделиИИ.ПустаяСсылка());
	МенеджерЗаписи.Операция = Контекст.ИдентификаторОперации;
	МенеджерЗаписи.Этап = "Подготовка";
	МенеджерЗаписи.Режим = Режим;
	МенеджерЗаписи.Решение = Результат.Решение;
	МенеджерЗаписи.КодОтказа = Результат.КодОтказа;
	МенеджерЗаписи.ТипыСущностей = ТипыСтрокой(Контекст);
	МенеджерЗаписи.КоличествоЗамен = ?(Обработка = Неопределено, 0, Обработка.Замен);
	МенеджерЗаписи.БылиЗамены = Результат.БылиЗамены;
	МенеджерЗаписи.ЕстьВложения = Обработка <> Неопределено И Обработка.ЕстьВложения;
	МенеджерЗаписи.ВерсияПравил = КИИ_ПравилаПерсональныхДанных.ВерсияПравил();
	МенеджерЗаписи.ВерсияГенератораПодстановок = ВерсияГенератора();
	МенеджерЗаписи.ДлительностьМиллисекунд = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	МенеджерЗаписи.СтатусАудита = "Записано";
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция ТипыСтрокой(Знач Контекст)

	Типы = Новый Массив;
	Для Каждого Элемент Из Контекст.ТипыСущностей Цикл
		Типы.Добавить(Элемент.Ключ);
	КонецЦикла;

	Возврат СтрСоединить(Типы, ", ");

КонецФункции

Функция ВерсияГенератора()

	Возврат "1.0";

КонецФункции

#КонецОбласти

#Область Хеш

Функция ХешСтроки(Знач Значение)

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(Значение);

	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

// Десятичные цифры из шестнадцатеричного хеша: каждый символ дает одну цифру.
Функция ЦифрыИзХеша(Знач Хеш, Знач Количество)

	Цифры = Новый Массив;
	Для Позиция = 1 По Количество Цикл
		Цифры.Добавить(Формат(ЗначениеСимволаХеша(Хеш, Позиция) % 10, "ЧН=0; ЧГ=0"));
	КонецЦикла;

	Возврат СтрСоединить(Цифры, "");

КонецФункции

Функция ЧислоИзХеша(Знач Хеш, Знач Смещение, Знач Символов)

	Значение = 0;
	Для Позиция = Смещение По Смещение + Символов - 1 Цикл
		Значение = Значение * 16 + ЗначениеСимволаХеша(Хеш, Позиция);
	КонецЦикла;

	Возврат Значение;

КонецФункции

Функция ЗначениеСимволаХеша(Знач Хеш, Знач Позиция)

	Возврат СтрНайти("0123456789abcdef", Сред(Хеш, Позиция, 1)) - 1;

КонецФункции

Функция ЭкранированныйВJSON(Знач Значение)

	Возврат СтрЗаменить(СтрЗаменить(Значение, "\", "\\"), """", "\""");

КонецФункции

#КонецОбласти

#КонецОбласти
